; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	Star1 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet16)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph1)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Phenomenon19)
	(pointing satellite1 Star13)
	(pointing satellite2 Planet14)
	(pointing satellite3 Phenomenon15)
	(have_image Phenomenon3 thermograph0)
	(have_image Star4 thermograph0)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 thermograph0)
	(have_image Star13 spectrograph1)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet16 thermograph0)
	(have_image Star17 spectrograph2)
	(have_image Star18 thermograph0)
	(have_image Phenomenon19 spectrograph2)
	(have_image Star20 spectrograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 19
2. (turn_to satellite4 star1 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star1)
   goals met: 0 of 19
3. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 19
4. (turn_to satellite4 phenomenon10 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 19
5. (take_image satellite4 phenomenon10 instrument7 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 1 of 19
6. (turn_to satellite4 phenomenon11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 19
7. (take_image satellite4 phenomenon11 instrument7 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 2 of 19
8. (turn_to satellite4 phenomenon15 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon15)
   goals met: 2 of 19
9. (take_image satellite4 phenomenon15 instrument7 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 19
10. (turn_to satellite4 phenomenon19 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon19)
   goals met: 3 of 19
11. (take_image satellite4 phenomenon19 instrument7 spectrograph2)
   added: (have_image phenomenon19 spectrograph2)
   goals met: 4 of 19
12. (turn_to satellite4 phenomenon3 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon3)
   goals met: 4 of 19
13. (take_image satellite4 phenomenon3 instrument7 thermograph0)
   added: (have_image phenomenon3 thermograph0)
   goals met: 5 of 19
14. (turn_to satellite4 phenomenon6 phenomenon3)
   deleted: (pointing satellite4 phenomenon3)
   added: (pointing satellite4 phenomenon6)
   goals met: 5 of 19
15. (take_image satellite4 phenomenon6 instrument7 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 6 of 19
16. (turn_to satellite4 phenomenon7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon7)
   goals met: 6 of 19
17. (take_image satellite4 phenomenon7 instrument7 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 7 of 19
18. (turn_to satellite4 planet12 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 planet12)
   goals met: 7 of 19
19. (take_image satellite4 planet12 instrument7 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 8 of 19
20. (turn_to satellite4 planet14 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet14)
   goals met: 8 of 19
21. (take_image satellite4 planet14 instrument7 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 9 of 19
22. (turn_to satellite4 planet16 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet16)
   goals met: 9 of 19
23. (take_image satellite4 planet16 instrument7 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 10 of 19
24. (turn_to satellite4 star13 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 star13)
   goals met: 10 of 19
25. (take_image satellite4 star13 instrument7 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 11 of 19
26. (turn_to satellite4 star17 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star17)
   goals met: 11 of 19
27. (take_image satellite4 star17 instrument7 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 12 of 19
28. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 12 of 19
29. (take_image satellite4 star18 instrument7 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 13 of 19
30. (turn_to satellite4 star20 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star20)
   goals met: 13 of 19
31. (take_image satellite4 star20 instrument7 spectrograph1)
   added: (have_image star20 spectrograph1)
   goals met: 14 of 19
32. (turn_to satellite4 star4 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star4)
   goals met: 14 of 19
33. (take_image satellite4 star4 instrument7 thermograph0)
   added: (have_image star4 thermograph0)
   goals met: 15 of 19
34. (turn_to satellite3 phenomenon15 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon15)
   goals met: 16 of 19
35. (turn_to satellite2 planet14 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet14)
   goals met: 17 of 19
36. (turn_to satellite1 star13 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star13)
   goals met: 18 of 19
37. (turn_to satellite0 phenomenon19 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon19)
   goals met: 19 of 19
